---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.EnableHookLengthOverride(System.Boolean)
zh: 钢筋、配筋
source: html/768754cc-5d24-3b25-84f2-82dee640d6ca.htm
---
# Autodesk.Revit.DB.Structure.Rebar.EnableHookLengthOverride Method

**中文**: 钢筋、配筋

Enables or disables the ability to override hook lengths for this rebar instance.

## Syntax (C#)
```csharp
public void EnableHookLengthOverride(
	bool enable
)
```

## Parameters
- **enable** (`System.Boolean`) - True to enable, False to disable.